WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetUnsignedInt_Client_Request-1.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetUnsignedInt</a:Action>
    <a:MessageID>urn:uuid:bbe18d87-7f60-4d61-bd59-b996e8978d0d</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetUnsignedInt xmlns="http://tempuri.org/">
      <inUInt xmlns="">4294967295</inUInt>
    </RetUnsignedInt>
  </s:Body>
</s:Envelope>